from sprites.text import Text

mc1 = Text(
    x=40,
    y=290,
    text='Знову привіт. У мене до тебе є питання:"Чи є у тебе викрутка?"'
)

bum1 = Text(
    x=40,
    y=290,
    text="Здоров, так, є. Але за неї тобі треба буде заплатити. Скільки у тебе зараз кришок?"
)

mc2 = Text(
    x=40,
    y=290,
    text="10"
)

bum2 = Text(
    x=40,
    y=290,
    text="Цього звісно буде замало, але як другу я продам її тобі за цю ціну."
)

mc3 = Text(
    x=40,
    y=290,
    text="Дякую!"
)

bum3 = Text(
    x=40,
    y=290,
    text="Та нема за що. А навіщо вона тобі потрібна?"
)

mc4 = Text(
    x=40,
    y=290,
    text="Ти скоро це побачиш..."
)

bum4 = Text(
    x=40,
    y=290,
    text="Ну добре. Мене хилить в сон, тому потім поспілкуємося. Бувай."
)

mc5 = Text(
    x=40,
    y=290,
    text="Гарних снів, прощавай..."
)

buml = [
    bum1,
    bum2,
    bum3,
    bum4
]

mcpl = [
    mc1,
    mc2,
    mc3,
    mc4,
    mc5
]