from sprites.text import Text

spy_sym = Text(
    x=37,
    y=232,
    text="Шпигун:"
)

mc1p = Text(
    x=40,
    y=290,
    text="Привіт! Я тут новенький і хочу познайомитися зі всіма. Як тебе звати?"
)

s1p = Text(
    x=40,
    y=290,
    text="Привіт. Я не буду називати свого імені, бо стіни мають вуха, але можеш звати мене шпигун."
)

mc2p = Text(
    x=40,
    y=290,
    text="Добре... У тебе є для мене якесь завдання?"
)

s2p = Text(
    x=40,
    y=290,
    text="Так. Зараз я тобі розповім деяку інформацію, а після виконання завдання розповім ще дещо."
)

s3p = Text(
    x=40,
    y=290,
    text="Тобі це буде корисно."
)

mc3p = Text(
    x=40,
    y=290,
    text="Окей, розповідай."
)

s4p = Text(
    x=40,
    y=290,
    text="Якщо ти хочеш втекти, то тобі треба вимкнути світло у підвалі, щоб тебе не помітили."
)

s5p = Text(
    x=40,
    y=290,
    text="Для цього тобі треба взяти у підсобці ключ від підвалу та пожежного виходу, ножиці, лопату. До речі,"
)


s6p = Text(
    x=40,
    y=290,
    text="її забули закрити, тому не переймася. Там також буде мотузка. Твоє завдання принести мені її."
)


s7p = Text(
    x=40,
    y=290,
    text="Так ось, у підвалі є щиток. За допомогою викрутки відкрути шурупи і зніми кришку."
)

s8p = Text(
    x=40,
    y=290,
    text="Потім ножицями переріж червоний дріт. Після виконання завдання розповім, де взяти викрутку."
)


s9p = Text(
    x=40,
    y=290,
    text="До речі, скоро охоронець буде на обідній перерві. Швидко зроби моє завдання та іди у підвал."
)

mc4p = Text(
    x=40,
    y=290,
    text="? Звідки ти-, хоча ладно, забули. Добре, зараз принесу тобі цю мотузку."
)





sp = [
    s1p,
    s2p,
    s3p,
    s4p,
    s5p,
    s6p,
    s7p,
    s8p,
    s9p
]

mcps = [
    mc1p,
    mc2p,
    mc3p,
    mc4p
]

mcp1 = Text(
    x=40,
    y=290,
    text="Ось, тримай."
)

sp1 = Text(
    x=40,
    y=290,
    text="Дякую. Так ось слухай, викрутку ти можеш взяти у безхатька."
)

sp2 = Text(
    x=40,
    y=290,
    text="Коли ти її візьмеш, прямуй до підвалу та роби так, як я сказала."
)

sp3 = Text(
    x=40,
    y=290,
    text="Коли світла не буде, виходь на вулицю через пожежний вихід."
)

sp4 = Text(
    x=40,
    y=290,
    text="Коли ти будешь на вулиці, то підійди до паркану і зроби підкоп. І все, ти на волі."
)

sp5 = Text(
    x=40,
    y=290,
    text="Ну все, хай тобі щастить..."
)

mcp2 = Text(
    x=40,
    y=290,
    text="Добре, тобі теж удачі!"
)

spl2 = [
    sp1,
    sp2,
    sp3,
    sp4,
    sp5
]

mcl2 = [
    mcp1,
    mcp2
]