from sprites.text import Text



sys_dig_t = Text(
    x=600,
    y=500,
    text="Затисніть [t] для того, щоб почати копати"
)

sys_press_e = Text(
    x=400,
    y=230,
    text="Натисніть [e] для того, щоб продовжити"
)

sys_press_r = Text(
    x=400,
    y=230,
    text="Натисніть [r] для того, щоб продовжити"
)

sys_exit_e = Text(
    x=400,
    y=230,
    text="Натисніть [e] для того, щоб закрити"
)

sys_exit_esc = Text(
    x=420,
    y=275,
    text="Натисніть [esc] для того, щоб закрити"
)

sys_exit_esc_b = Text(
    x=400,
    y=20,
    text="Натисніть [esc] для того, щоб закрити"
)


sys_take_all_form_storeroom = Text(
    x=45,
    y=265,
    text="Заберіть усе з підсобки!"
)

sys_take_meat = Text(
    x=830,
    y=500,
    text="Заберіть м'ясо у їдальній!"
)

sys_y = Text(
    x=120,
    y=20,
    text="Y"
)

sys_g = Text(
    x=1070,
    y=20,
    text="G"
)

sys_h = Text(
    x=120,
    y=750,
    text="H"
)

sys_j = Text(
    x=1070,
    y=750,
    text="J"
)

sys_press_c = Text(
    x=740,
    y=775,
    text="Натисніть [c] для того, щоб продовжити"
)

sys_press_x = Text(
    x=400,
    y=20,
    text="Натисніть [x] для того, щоб перерізати дріт"
)


# sys_press_t = Text(
#     x=400,
#     y=230,
#     text="Натисніть [t] для того, щоб продовжити"
# )


mc_sym = Text(
    x=37,
    y=232,
    text="Ви:"
)

mc1p = Text(
    x = 40,
    y=290,
    text='Доброго дня...'
)

mc2p = Text(
    x=40,
    y=290,
    text="Так, вірно підмітив. Знаєш, це було якось швидко, тому навіть не знаю, що сказати..."
)

mc3p = Text(
    x=40,
    y=290,
    text="Дякую за розуміння. Ти можеш, будь ласка, розповісти мені про це місце?"
)





bum_sym = Text(
    x=37,
    y=232,
    text="Безхатько:"
)

bum1p = Text(
    x=40,
    y=290,
    text="Привіт. Я так бачу, що ти нещодавно сюди приїхав. Чому ти тут знаходишся?"
)

bum2p = Text(
    x=40,
    y=290,
    text="Тоді розкажеш, як будешь готовий."
)

# bum3p = Text(
#     x=40,
#     y=290,
#     text=""
# )

bum3p = Text(
    x=40,
    y=290,
    text="Без проблем. Ця лікарня імені Миколая. Чудовий чолов'яга, програміст. "
)  

bum4p = Text(
    x=40,
    y=290,
    text="Я його учнем був, але не слухав його на уроках, ну і закінчив на вулиці..."
)

bum5p = Text(
    x=40,
    y=290,
    text="Так, щось мене не в те русло понесло... Пацієнти тут не завдадуть тобі шкоди. Цей корпус не для буйних."
)



bum6p = Text(
    x=40,
    y=290,
    text="У нас, пацієнтів, є своя валюта - кришки від пляшок."
)

bum7p = Text(
    x=40,
    y=320,
    text="Якщо ти хочеш, щоб за тебе щось зробили, ти можеш запропонувати натомість кришки."
)

bum8p = Text(
    x=40,
    y=290,
    text="Якщо у пацієнтів над головою є знак оклику, то ти можеш з ними поговорити,"
)

bum9p = Text(
    x=40,
    y=320,
    text="і у них може бути для тебе буде якесь завдання."
)

bum10p = Text(
    x=40,
    y=290,
    text="Якщо над головами пацієнтів є стрілочка, яка вказує на них, це означає,"
)

bum11p = Text(
    x=40,
    y=320,
    text = "що ти взяв у них завдання і він чекає, коли ти його виконаєш."
)

bum12p = Text(
    x=40,
    y=290,
    text="Також на першому поверсі є охоронець. Він ходить біля підвалу та пожежного виходу."
)

bum13p = Text(
    x=40,
    y=320,
    text="Якщо він тебе спіймає, то в тебе забереться одне життя."
)

bum14p = Text(
    x=40,
    y=290,
    text="Начебто все. Здається ти не поганий хлопець, сподіваюся потоваришуємо. Іди познайомся з іншими."
)



mc_bum_phrases = [mc1p, mc2p, mc3p]

bum_1_phrases = [bum1p, bum2p, bum3p, bum4p, bum5p, bum6p, bum7p, bum8p, bum9p, bum10p, bum11p, bum12p, bum13p, bum14p]